In [1]:
print("Working with Pandas")

Working with Pandas

## Working with Pandas

    Pandas is used for 
        - Data import, export
        - Data Wrangling, manipulation, filtering, aggregation
        - Data Cleaning
        - Statistical Analysis

     Pandas primarily has two data types - 
         - Pandas Series - 1D data
         - Pandas Dataframe - 2D data

In [4]:
import pandas as pd

In [5]:
data = {"Name":['Anshu','Aisha','Varun','Puneet','Dipesh','Chetna'],
        "Gender":['M','F','M','M',"M",'F'],
        "Age":[25,24,26,32,34,36]}

df = pd.DataFrame(data)

In [6]:
df

     Name Gender  Age
0   Anshu      M   25
1   Aisha      F   24
2   Varun      M   26
3  Puneet      M   32
4  Dipesh      M   34
5  Chetna      F   36

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.head(3)

    Name Gender  Age
0  Anshu      M   25
1  Aisha      F   24
2  Varun      M   26

In [9]:
df.tail(2)

     Name Gender  Age
4  Dipesh      M   34
5  Chetna      F   36

In [10]:
df['Name']

0     Anshu
1     Aisha
2     Varun
3    Puneet
4    Dipesh
5    Chetna
Name: Name, dtype: object

In [11]:
df[['Name','Age']]

     Name  Age
0   Anshu   25
1   Aisha   24
2   Varun   26
3  Puneet   32
4  Dipesh   34
5  Chetna   36

In [12]:
df['City'] = ['DXB','AUH','KUL','DXB','KUL','AUH']
df

     Name Gender  Age City
0   Anshu      M   25  DXB
1   Aisha      F   24  AUH
2   Varun      M   26  KUL
3  Puneet      M   32  DXB
4  Dipesh      M   34  KUL
5  Chetna      F   36  AUH

## Data Selection

In [13]:
# selecting a column
df.Name

0     Anshu
1     Aisha
2     Varun
3    Puneet
4    Dipesh
5    Chetna
Name: Name, dtype: object

In [14]:
df['Name']

0     Anshu
1     Aisha
2     Varun
3    Puneet
4    Dipesh
5    Chetna
Name: Name, dtype: object

In [15]:
# selecting two columns
df[['Name','Age']]

     Name  Age
0   Anshu   25
1   Aisha   24
2   Varun   26
3  Puneet   32
4  Dipesh   34
5  Chetna   36

In [16]:
# selecting rows
df[2:6]

     Name Gender  Age City
2   Varun      M   26  KUL
3  Puneet      M   32  DXB
4  Dipesh      M   34  KUL
5  Chetna      F   36  AUH

In [17]:
# selecting rows and columns
df[2:6][['Name','Age']]

     Name  Age
2   Varun   26
3  Puneet   32
4  Dipesh   34
5  Chetna   36

In [21]:
df.loc[2]

Name      Varun
Gender        M
Age          26
City        KUL
Name: 2, dtype: object

## Data Filtering

In [18]:
# numeric filters
df[df.Age<30]

    Name Gender  Age City
0  Anshu      M   25  DXB
1  Aisha      F   24  AUH
2  Varun      M   26  KUL

In [19]:
# categorical filter
df[df.Gender=='M']

     Name Gender  Age City
0   Anshu      M   25  DXB
2   Varun      M   26  KUL
3  Puneet      M   32  DXB
4  Dipesh      M   34  KUL

In [20]:
df[df.Age<30][df.Gender=='M']

<ipython-input-20-ecd5a50b0eb1>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.Age<30][df.Gender=='M']

    Name Gender  Age City
0  Anshu      M   25  DXB
2  Varun      M   26  KUL